import { Link } from "react-router-dom"


const Home = () => {
  return (
    <main className="border h-screen w-[75%] mx-auto flex">
      {/* left */}
          <div className="flex">
              <div className="w-[25%]">
                  <h1>भारत</h1> 
                  <h2>आज आम चुनाव हों तो NDA जीतेगा 324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</h2>
                  <p>इंडिया टुडे ने सी-वोटर के साथ 'मूड ऑफ द नेशन' सर्वे किया है.
                     देश के सभी राज्यों और लोकसभा क्षेत्रों में 1 जुलाई से 14 अगस्त 2025 
                     के बीच ये सर्वे किया गया. इस सर्वे का मकसद था देश का मूड भांपना. सर्वे में...</p>
                     <span>10 hours ago</span>

              </div>
              <img src="/india.png" />
          </div>

          <aside>
             
                <div>
                   <hr/>
                  <h1>ताजा खबर</h1>
                  <Link to={""}>और देखें</Link>
                   <hr/>
                </div>
                <div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                   <div>
                     <h1>भारत</h1>
                   <p>आज आम चुनाव हों तो NDA जीतेगा 
                    324 सीटें मगर अपने दम पर बहुमत से पीछे रहेगी BJP: सर्वे</p>
                     <hr/>
                   </div>
                </div>
          </aside>
    </main>
  )
}

export default Home